src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>WebСервисОборудование</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ОбработчикиДрайверовПодключаемогоОборудования/ОбработчикиДрайверовПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиДрайверовПодключаемогоОборудования</name>
  <enumValues>
    <name>Обработчик1СWebСервисОборудование</name>
    <comment>WebСервисОборудование</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СДисплейПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СПринтерЧеков</name>
    <comment>ПринтерЧеков</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыМебиус</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыФеликс</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкодаNative</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКартNative</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СФискальныйРегистраторЭмулятор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикACOMВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикERFIDСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIboxProПоддержкаMPosЭквайринга</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикScaleCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикTRPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя8X</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода8X</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт8X</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы8X</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы8X</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикВерсияТФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыPulsar</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсСчитывателиRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикОРИОНФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикПриватбанкЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСБРФЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанныхNative</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСофтКейсЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМOffline</name>
    <comment>ККМOffline</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
</mdclass:Enum>

src/CommonModules/МенеджерОборудованияВызовСервераПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список доступных типов оборудования.
// 
// Возвращаемое значение:
//   Массив - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	// Сканеры штрихкода
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
	// Конец Сканеры штрихкода

	// Терминалы сбора данных
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных);
	// Конец Терминалы сбора данных.
	
	// Web-Сервис оборудование
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.WebСервисОборудование);
	// Конец Сервис-оборудование
	
	Возврат СписокОборудования;
	
КонецФункции

// Возвращает флаг возможности добавления новых драйверов в справочник драйверов.
// 
// Возвращаемое значение:
//   Булево - В случае разрешение добавления новых драйверов возвращает Истина.
//
Функция ВозможностьДобавленияНовыхДрайверов() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным из текущего сеанса.
//  
// Возвращаемое значение:
//  Булево - В случае вызова в неразделенной конфигурации возвращает Истина.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Обновить поставляемые драйверы в составе конфигурации.
//                                   
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	// Сканеры штрихкода
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода, "AddIn.ScancodeScanner", "ДрайверСканкодСканерШтрихкода", Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода, "AddIn.Scaner45", , Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода, "AddIn.Scanner", "Драйвер1ССканерШтрихкода", Ложь, "8.1.7.10");
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкодаNative, "AddIn.InputDevice", "Драйвер1СУстройстваВводаNative", Ложь, "8.1.7.10");
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода, "AddIn.ProtonScanner", "ДрайверГексагонСканерШтрихкода", Ложь);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода8X, "AddIn.ATOL_Scaners_1CInt", "ДрайверАТОЛУстройстваВвода8X", Ложь);
	// Конец Сканеры штрихкода
	
	// Терминалы сбора данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных, "AddIn.PDX45", , Истина, , Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонТерминалыСбораДанных, "AddIn.ProtonTSD", "ДрайверГексагонТСД", Ложь, "6.6");
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных, "AddIn.CipherLab", , Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных, "AddIn.iPOSoft_DT", "ДрайверСканситиТСДCipherLab", Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКлеверенсТерминалыСбораДанных, "AddIn.Cleverence.TO_TSD", "ДрайверКлеверенсТСД", Ложь);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных, "AddIn.Terminals", , Истина);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанныхMobileLogistics, "AddIn.PDX1C_Int", "ДрайверАТОЛТСДMobileLogistics", Ложь);
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанныхNative, "AddIn.CipherLab8", "ДрайверСканкодТерминалыСбораДанныхNative", Ложь, "1.0.0.4");
	// Конец Терминалы сбора данных.
		
	// Web-Сервис оборудование
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование);
	// Конец Web-Сервис оборудование
	
КонецПроцедуры

// Обновление библиотеки в целевой конфигурации.
//                                   
Процедура ОбновлениеБиблиотеки() Экспорт
	
	ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

#КонецОбласти

#Область ОборудованиеOffline

// Функция возвращает префикс весового товара применяемого для генерации штрихкода.
// Используется при выгрузке в весы с печатью этикеток.
//
// Параметры:
//  ПодключаемоеОборудованиеСсылка - Ссылка на экземпляр подключаемого оборудования.
// 
// Возвращаемое значение:
//   Число - Префикс весового товара.
//
Функция ПолучитьПрефиксВесовогоТовара(ПодключаемоеОборудованиеСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Функция возвращает префикс штучного товара применяемого для генерации штрихкода.
// Используется при выгрузке в весы с печатью этикеток.
//
// Параметры:
//  ПодключаемоеОборудованиеСсылка - Ссылка на экземпляр подключаемого оборудования.
// 
// Возвращаемое значение:
//   Число - Префикс штучного товара который фасуется на весах.
//
Функция ПолучитьПрефиксШтучногоТовара(ПодключаемоеОборудованиеСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
Процедура ЭкземплярОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ЭкземплярОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт

КонецПроцедуры

#КонецОбласти
